// Arduino C/C++                                      *** NotyNaArduino.ino ***

// ****************************************************************************
// * ittve-ESP32-CAM           Сделать четырехклавишное безконтактное пианино *
// *                                         на базе макетной платы и Ардуино *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  02.07.2023
// Copyright © 2023 tve                              Посл.изменение: 02.07.2023


//#include "esp_camera.h"
//#include <WiFi.h>

//
// WARNING! Для разрешения UXGA и высокого качества JPEG требуется микросхема PSRAM.
// Убедитесь, что выбран модуль ESP32 Wrover или другая плата с PSRAM.
// Изображения будут переданы частично, если изображение превышает размер буфера.
//
// PSRAM — это дополнительный напаянный чип RAM помимо встроенной памяти. Обычно 
// указывается в описании к плате и бывает размером 2 или 8 Мб. Дополнительная 
// оперативная память необходима, если подключается дисплей для вывода

// Select camera model
//#define CAMERA_MODEL_WROVER_KIT // Has PSRAM
//#define CAMERA_MODEL_ESP_EYE // Has PSRAM



void setup() 
{
  // put your setup code here, to run once:
}

void loop() 
{
}


// ****************************************************** NotyNaArduino.ino ***
