// Arduino C/C++                                        *** BlinkOnCam32.ino ***

// *****************************************************************************
// * ittve-ESP32-CAM             Заставляем ESP32-CAM мигать своими лампочками *
// *****************************************************************************

//                                                    Автор:       Труфанов В.Е.
//                                                    Дата создания:  31.05.2024
// Copyright © 2024 tve                               Посл.изменение: 31.05.2024

void setup() 
{
   // Переводим контакты лампочек в режим вывода
   pinMode(33,OUTPUT);  // "работает"
   
   //pinMode(4,OUTPUT);   // "вспышка"
   
}

void loop() 
{
   digitalWrite(33,LOW);
   //digitalWrite(4,LOW);
   delay(1000);
   digitalWrite(33,HIGH);
   //digitalWrite(4,HIGH);
   delay(500);
}

// ******************************************************** BlinkOnCam32.ino ***
