/** Arduino-Esp32-CAM                                          *** Mems.cpp ***
 * 
 *                         Обеспечить контроль расхода памяти контроллера Esp32 
 * 
 * v1.0.0, 20.02.2025                                 Автор:      Труфанов В.Е.
 * Copyright © 2025 tve                               Дата создания: 20.02.2025
 * 
**/

#include "Arduino.h"
#include "Mems.h"   

// ****************************************************************************
// *                    Построить объект (конструктор класса)                 *
// ****************************************************************************
TMems::TMems(int i)
{
  ii=i;
}
// ****************************************************************************
// *                        Зафиксировать состояние памяти                    *
// ****************************************************************************
void TMems::Fix()
{
  HeapSize  = ESP.getHeapSize();
  FreeHeap  = ESP.getFreeHeap();
  PsramSize = ESP.getPsramSize();
  FreePsram = ESP.getFreePsram();
}
// ****************************************************************************
// *                          Показать изменения в памяти                     *
// ****************************************************************************
void TMems::Diff()
{
  CurFreeHeap  = ESP.getFreeHeap();
  CurFreePsram = ESP.getFreePsram();
  
  //Serial.println("");
  printf("Доступная память в куче:         %u\n", FreeHeap);
  printf("Оставшаяся память в куче:        %u\n", CurFreeHeap);
  printf("Доступная память уменьшилась на: %u\n\n", FreeHeap-CurFreeHeap);
  
  //printf("Количество свободной PSRAM:      %d\n", FreePsram);
  //printf("Оставшаяся свободная PSRAM:      %d\n", CurFreePsram);
  //printf("Свободная PSRAM уменьшилась на:  %u\n\n", FreePsram-CurFreePsram);
}
// ****************************************************************************
// *                          Показать память в моменте                       *
// ****************************************************************************
void TMems::View()
{
  printf("Оставшаяся память в куче:        %u\n", ESP.getFreeHeap());
  printf("Оставшаяся свободная PSRAM:      %d\n", ESP.getFreePsram());
}
// ****************************************************************************
// *                 Показать зафиксированную информацию по памяти            *
// ****************************************************************************
void TMems::FixView()
{
  printf("Общий размер ВСТРОЕННОЙ памяти:  %u\n", HeapSize);
  printf("Общий размер SPI PSRAM:          %u\n", PsramSize);
  printf("Доступная память в куче:         %u\n", FreeHeap);
  printf("Количество свободной PSRAM:      %d\n", FreePsram);
}

// *************************************************************** Mems.cpp ***
